### Importacion de Librerias y Modulos

In [1]:
from functions.datos import Simulador_Ventas
import functions.limpiar_datos as ld
import functions.modelado as md
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from ipywidgets import widgets
from IPython.display import display

# Generar archivos CSV para Ventas y Clientes

### Contenido:
Modulo datos.py creado para generar csv bajo los siguientes lineamientos:

1. Generar dos archivos CSV llamados "ventas.csv" y "clientes.csv" que contengan los datos de ventas y clientes, respectivamente. 
2. Los datos deben ser generados aleatoriamente utilizando funciones de probabilidad (indique en su informe que distribución uso: uniforme, normal u otra).
3. Los valores nulos deben representarse con la palabra "NULL". En el archivo "ventas.csv"
    - La columna "Producto" puede contener hasta un 10% de valores nulos. 
    - En el archivo "clientes.csv", las columnas "Nombre" y "Edad" pueden contener hasta un 5% de valores nulos cada una.

In [2]:
num_ventas = 100
num_clientes = 50
Simulador_Ventas(num_ventas,num_clientes)

Archivo 'clientes.csv' generado con exito
Archivo 'ventas.csv' generado con exito

/Users/airi0x02/Documents/Software_DS/ICIF1042_Taller2/functions/datos.py:47: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df_ventas = df_ventas._append(venta, ignore_index=True)

# Limpieza de Datos

1. Cargar los datos de ventas y clientes desde los archivos CSV generados utilizando Pandas y almacenarlos en DataFrames separados.
2. Realizar una limpieza de datos inicial en ambos DataFrames, manejando los valores nulos y convirtiendo los tipos de datos según sea necesario.
   Documentar en el informe los pasos realizados para la limpieza de datos. Realizar una limpieza de datos inicial en ambos DataFrames, 
   manejando los valores nulos y convirtiendo los tipos de datos según sea necesario. Documentar en el informe los pasos realizados para la limpieza de datos. 

## Exploración de Datos
### Ventas:

In [11]:
df_ventas = ld.LeerArchivo("data/ventas.csv")
df_ventas.head()

,ID_Venta,ID_Cliente,Categoría,Producto,Precio,Cantidad
0,1,29.0,Electrodomesticos,Tostadora,17716.092197,2
1,2,30.0,Electrónica,Televisor,171657.673484,1
2,3,43.0,Tecnologia,Cámara,12560.408615,5
3,4,1.0,Hogar,Horno Eléctrico,105106.264491,2
4,5,37.0,Hogar,Estufa Eléctrica,408222.182658,2
...,...,...,...,...,...,...
95,96,37.0,Electrodomesticos,Batidora,8058.030238,5
96,97,2.0,Tecnologia,Bateria,16119.645858,1
97,98,40.0,Hogar,Estufa Eléctrica,97053.479203,4
98,99,34.0,Tecnologia,Lámpara,19058.947670,3
99,100,NaN,Tecnologia,Lámpara,4407.997171,1

In [12]:
df_ventas = ld.Limpiar_Datos(df_ventas,'ventas')
df_ventas.head()

Las filas de 'ventas' columna 'Producto' que contengan valores NULL serán imputadas con la Moda
Las filas de 'ventas' que contengan valores NULL serán eliminadas

/Users/airi0x02/Documents/Software_DS/ICIF1042_Taller2/functions/limpiar_datos.py:32: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Producto"].fillna(data["Producto"].mode()[0], inplace=True)

,ID_Venta,ID_Cliente,Categoría,Producto,Precio,Cantidad
0,1,29.0,Electrodomesticos,Tostadora,17716.092197,2
1,2,30.0,Electrónica,Televisor,171657.673484,1
2,3,43.0,Tecnologia,Cámara,12560.408615,5
3,4,1.0,Hogar,Horno Eléctrico,105106.264491,2
4,5,37.0,Hogar,Estufa Eléctrica,408222.182658,2

In [13]:
ld.Conversion_Datos(df_ventas,'ventas')
df_ventas.head()

   ID_Venta  ID_Cliente          Categoría          Producto  Precio  Cantidad
0         1          29  Electrodomesticos         Tostadora   17716         2
1         2          30        Electrónica         Televisor  171657         1
2         3          43         Tecnologia            Cámara   12560         5
3         4           1              Hogar   Horno Eléctrico  105106         2
4         5          37              Hogar  Estufa Eléctrica  408222         2

#### Clientes:

In [14]:
df_clientes = ld.LeerArchivo("data/clientes.csv")
df_clientes.head()

   ID_Cliente            Nombre  Edad     Genero Ubicacion
0           1        Lily Brown    22   Femenino     Norte
1           2         Ethan Lee    63  Masculino     Norte
2           3        Noah Brown    53  Masculino     Oeste
3           4     Daniel Martin    36  Masculino    Centro
4           5  Sophia Robertson    45   Femenino    Centro

In [8]:
df_clientes = ld.Limpiar_Datos(df_clientes,'clientes')
df_clientes.head()

Las filas de 'clientes' columna 'Edad' que contengan valores NULL serám imputadas con la Media
Las filas de 'clientes' columna 'Nombre' que contengan valores NULL serám imputadas con la Moda

/Users/airi0x02/Documents/Software_DS/ICIF1042_Taller2/functions/limpiar_datos.py:35: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Edad"].fillna(data["Edad"].mean(), inplace=True)
/Users/airi0x02/Documents/Software_DS/ICIF1042_Taller2/functions/limpiar_datos.py:37: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["Nombre"].fillna(data["Nombre"].mode()[0], inplace=True)

   ID_Cliente            Nombre  Edad     Genero Ubicacion
0           1        Lily Brown    22   Femenino     Norte
1           2         Ethan Lee    63  Masculino     Norte
2           3        Noah Brown    53  Masculino     Oeste
3           4     Daniel Martin    36  Masculino    Centro
4           5  Sophia Robertson    45   Femenino    Centro

In [9]:
df_clientes = ld.Conversion_Datos(df_clientes,'clientes')
df_clientes.head()

   ID_Cliente            Nombre  Edad     Genero Ubicacion
0           1        Lily Brown    22   Femenino     Norte
1           2         Ethan Lee    63  Masculino     Norte
2           3        Noah Brown    53  Masculino     Oeste
3           4     Daniel Martin    36  Masculino    Centro
4           5  Sophia Robertson    45   Femenino    Centro